Repository: cornwarecjp/ultimatestunts
Catalog: trunk/ultimatestunts/po/*.po
Languages: de

source: Anonymous
de: Anonym

source: Computer
de: Rechner

source: Human
de: Mensch

source: Main menu
de: Hauptmenü

source: Drive!
de: Fahren!

source: Set the game type
de: Spielart einstellen

source: Select the track
de: Strecke auswählen

source: Players and cars
de: Spieler und Wagen

source: View a replay
de: Wiederholung ansehen

source: Settings
de: Einstellungen

source: Credits and License
de: Vielen dank an / Lizenz

source: Exit
de: Ende

source: [Local Game]
de: [Lokales Spiel]

source: [Running server %s]
de: [Server %s läuft]

source: [Joining game on server %s]
de: [Nehme an Spiel am Server %s teil]

source: [server will choose one]
de: [Server wird eins aussuchen]

source: [%d player selected]
de: [%d Spieler ausgewählt]

source: Select the game type:
de: Art des Spiels auswählen:

source: Local game
de: Lokales Spiel

source: Join an existing LAN/network game
de: Nimm an existierendem LAN/Netzwerk-Spiel teil

source: Start a new LAN/network game
de: Starte ein neues LAN/Netzwerk-Spiel

source: Join an existing online game
de: Nimm an existierendem online-Spiel teil

source: Start a new online game
de: Starte ein neues online-Spiel

source: Select a server:
de: Einen Server auswählen:

source: Select a track
de: Eine Strecke auswählen

source: Edit track
de: Strecke Bearbeiten

source: View best time replay
de: Replay der besten Zeit ansehen

source: Return to main menu
de: Zurück zum Hauptmenü

source: Select a replay file:
de: Eine Wiederholungs-Datei auswählen

source: Players menu:
de: Spielermenü:

source: Add a player
de: Spieler hinzufügen

source: Configure Player:
de: Spieler konfigurieren

source: manual
de: Manuell

source: automatic
de: Automatisch

source: Player type:
de: Spielertyp:

source: Car :
de: Wagen :

source: Gearbox :
de: Getriebe :

source: Choose a car color
de: Wagenfarbe

source: Delete this player
de: Spieler löschen

source: Ready
de: Fertig

source: Select a car for %s:
de: Wagen für %s:

source: Settings menu:
de: Einstellungsmenü:

source: Loading
de: Lade

source: Hiscore
de: Die Besten

source: View replay
de: Replay ansehen

source: Save replay
de: Replay speichern

source: Play again
de: Nochmal Spielen

source: Do you really want to quit?
de: Willst du wirklich aussteigen?

source: The track must be selected on the server
de: Die Strecke muss am Server gewählt werden

source: Enter the port number:
de: Portnummer:

source: Connected to server "%s"
de: Verbunden mit Server "%s"

source: Could not find a server. Do you want to set it manually?
de: Konnte keinen Server finden. Manuell einstellen?

source: Enter the host name or IP number of the server:
de: Den Hostnamen oder die IP-Adresse eingeben:

source: Enter a name for the server:
de: Einen Namen für den Server angeben:

source: Minimum number of players to wait for (including AI players):
de: Auf wieviele Spieler warten? (inkl. Computergegner):

source: No best time available
de: Keine Bestzeit verfügbar

source: Best time:
de: Beste Zeit:

source: The best time replay for this track does not exist
de: Die Wiederholung der besten Zeit für diese Strecke existiert nicht

source: Enter the name:
de: Namen eingeben:

source: Car color:
de: Wagenfarbe:

source: Can't delete: there needs to be at least one player
de: Kann ich nicht löschen - minimum ein Spieler

source: Delete this player?
de: Diesen Spieler löschen?

source: Settings: %s
de: Einstellungen: %s

source: Some settings are changed. Do you wish to save the settings?
de: Einstellungen wurden verändert. Willst du diese speichern?

source: Saving failed
de: Speichern fehlgeschlagen

source: Applying the new value failed
de: Dieser Wert kann nicht eingestellt werden

source: (this race)
de: (dieses Rennen)

source: Enter the replay filename:
de: Namen der Wiederholungs-Datei eingeben:

source: File %s already exists. Overwrite?
de: Die Datei %s existiert bereits. Überschreiben?

source: Connecting to the server failed
de: Verbindungsaufbau fehlgeschlagen

source: Player %s was refused
de: Spieler %s wurde zurückgewiesen

source: Frame rate: %.1f FPS
de: Vollbilder: %.1f FPS

source: Waiting for the server to start
de: Warte auf den Start des Servers

source: Waiting for %d remaining player to join
de: Warte noch auf %d Spieler

source: Running a game
de: Spiel läuft

source: Stopping the game
de: Spiel wird angehalten

source: Game is being started
de: Spiel wird gestartet

source: Waiting for client processes
de: Warten auf Client-Prozesse

source: Cancel
de: Abbrechen

source: Yes
de: Ja

source: No
de: Nein

source: <press a key>
de: <eine taste drücken>

source: System's default language
de: Sprachauswahl

source: Language:
de: Sprache

source: Full screen mode?
de: Vollbildmodus?

source: Enter window width:
de: Fensterbreite eingeben:

source: Enter window height:
de: Fensterhöhe eingeben:

source: Enter screen resolution width:
de: Bildschirmauflösung eingeben:

source: Enter screen resolution height:
de: Vertikale Auflösung:

source: Default resolution
de: Übliche Auflösung

source: Select a screen resolution:
de: Eine Auflösung auswählen:

source: Programmers:
de: Programmierer:

source: Art designers:
de: Art Designer:

source: Music:
de: Musik:

source: Translations:
de: Übersetzungen:

source: Website:
de: Webseite:

source: Please visit www.ultimatestunts.nl
de: Bitte besuche www.ultimatestunts.nl

source: License:
de: Lizenz:

source: Hello, world!
de: Hallo, Welt!

source: GO!
de: LOS!

source: Penalty time:
de: Strafzeit:

source: You finished (waiting for other players)
de: Fertig (mit warten auf andere Spieler)

source: Error: more than one start in the track
de: Fehler: mehr als ein Start in der Strecke

source: Error: more than one finish in the track
de: Fehler: mehr als ein Ziel in der Strecke

source: Loading files
de: Lade Dateien

source: Game paused
de: Spiel Pausiert

source: Change tiles collection
de: Kachelsammlung ändern

source: Edit this tile
de: Kachel editieren

source: Change scenery settings
de: Umgebungseinstellungen ändern

source: Add a new tile
de: Kachel hinzufügen

source: Remove unused tiles
de: Entferne nicht verwendete Kacheln

source: Change the tile model
de: Kachelmodell ändern

source: Delete this tile
de: Kachel löschen

source: Change the cloud image
de: Wolkenbild ändern

source: Change the background image
de: Hintergrundbild ändern

source: Change the sky color
de: Himmelsfarbe ändern

source: Change the horizon sky color
de: Farbe des Horizonts ändern

source: Change the cloud and background color
de: Wolken und Hintergrundfarbe ändern

source: Change the fog color
de: Nebelfarbe ändern

source: Change the light color
de: Lichtfarbe ändern

source: Change the light direction
de: Richtung des Lichts ändern

source: Error: %s could not be loaded
de: Fehler: %s kann nicht geladen werden

source: Select the Stunts track
de: Strecke auswählen

source: Tracks:
de: Strecken:

source: Enter the filename:
de: Dateinamen eingeben:

source: File %s already exists. Overwrite? The hiscore of the track will be reset.
de: Die Datei %s existiert bereits. Überschreiben? Hierbei werden die Höchstpunktezahlen gelöscht.

source: Saving of %s failed
de: Speichern von %s fehlgeschlagen

source: This tile is in use in the track. Do you really want to change it?
de: Diese Kachel wird in der Strecke verwendet. Wiklich ändern?

source: This tile is in use in the track. Do you really want to delete it?
de: Diese Kachel wird in der Strecke verwendet. Wirklich löschen?

source: Tiles:
de: Kacheln:

source: Cloud image file:
de: Name der Bilddatei für Wolken:

source: Background image file:
de: Name der Hintergrundbild-datei:

source: Sky color:
de: Himmelsfarbe:

source: Horizon sky color:
de: Horizont Farbe:

source: Cloud and background color:
de: Wolken und Hintergrundfarbe:

source: Fog color:
de: Nebelfarbe:

source: Light color:
de: Lichtfarbe:

source: Light compass direction (degrees):
de: Beleuchtungsrichtung in grad:

source: Light angle above the horizon (degrees):
de: Lichtwinkel ober des Horizonts in grad:

source: Number of tiles to add on the west side (negative = remove tiles):
de: Wieviele Kacheln an der Westseite hinzufügen? (negative nummern entfernen diese):

source: Number of tiles to add on the east side (negative = remove tiles):
de: Wieviele Kacheln an der Ostseite hinzufügen? (negative nummern entfernen diese):

source: Number of tiles to add on the north side (negative = remove tiles):
de: Wieviele Kacheln an der Nordseite hinzufügen? (negative nummern entfernen diese):

source: Number of tiles to add on the south side (negative = remove tiles):
de: Wieviele Kacheln an der Südseite hinzufügen? (negative nummern entfernen diese):

source: Load track
de: Lade Strecke

source: Import Stunts track
de: Stunts-Strecke importieren

source: Save track
de: Strecke speichern

source: Undo
de: Rückgängig

source: Redo
de: Nochmal

source: Resize the track
de: Streckengrösse ändern
